renesas/ra-fsp-examples/example_projects/ek_ra4l1/_quickstart/quickstart_ek_ra4l1_ep/e2studio/src/slcd.c
/***********************************************************************************************************************
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name    : slcd.c
 * Version      : .
 * Description  : .
 *********************************************************************************************************************/

#include "slcd.h"
#include "hal_data.h"
#include "jlink_console.h"
#include "r_typedefs.h"
#include "common_init.h"

/**
 * Clear segment command
 */
#define CLEAR_WRITE_DATA    (0x00)

/**
 * Number of the first segment.
 */
#define START_SEGMENT (0u)

/**
 * Number of the last segment.
 */
#define END_SEGMENT (43u)

/**
 * Number of segments. Note: not all must be used, it is a difference between last and first segment.
 */
#define SEGMENT_COUNT (END_SEGMENT - START_SEGMENT)

/**
 * Segment LCD frame buffer.
 */
static uint8_t s_slcd_frame_buffer[SEGMENT_COUNT] =
{ };

const st_icon_segment_t g_day_of_week_segment[7] =
{
    { SUNDAY_SEGMENT,    SUNDAY_DATA    },
    { MONDAY_SEGMENT,    MONDAY_DATA    },
    { TUESDAY_SEGMENT,   TUESDAY_DATA   },
    { WEDNESDAY_SEGMENT, WEDNESDAY_DATA },
    { THURSDAY_SEGMENT,  THURSDAY_DATA  },
    { FRIDAY_SEGMENT,    FRIDAY_DATA    },
    { SATURDAY_SEGMENT,  SATURDAY_DATA  }
};

const st_icon_segment_t g_battery_level_segment[5] =
{
    { BATTERY_SHELL_SEGMENT, BATTERY_SHELL_DATA },                              /* BATTERY_EMPTY OR BATTERY_0 */
    { BATTERY_LEVEL1_SEGMENT, BATTERY_LEVEL1_DATA },                            /* BATTERY_1 */
    { BATTERY_LEVEL2_SEGMENT, (BATTERY_LEVEL1_DATA | BATTERY_LEVEL2_DATA) },    /* BATTERY_2 */
    { BATTERY_LEVEL3_SEGMENT, (BATTERY_LEVEL1_DATA | BATTERY_LEVEL2_DATA | BATTERY_LEVEL3_DATA) },
                                                                                /* BATTERY_3 */
    { BATTERY_LEVEL4_SEGMENT, (BATTERY_LEVEL1_DATA | BATTERY_LEVEL2_DATA | BATTERY_LEVEL3_DATA | BATTERY_LEVEL4_DATA) }
                                                                                /* BATTERY_FULL OR BATTERY_4 */
};

const st_icon_segment_t g_am_or_pm[2] =
{
    { AM_SEGMENT, AM_DATA },
    { PM_SEGMENT, PM_DATA } };

const st_icon_segment_t g_degc_or_degf[2] =
{
    { DEG_C_SEGMENT, DEG_C_DATA },
    { DEG_F_SEGMENT, DEG_F_DATA } };

const st_icon_segment_t g_medium_digit_dp_or_colon[2] =
{
    { MEDIUM_DIGIT_DEC_POINT_SEGMENT, MEDIUM_DIGIT_DEC_POINT_DATA },
    { MEDIUM_DIGIT_COLON_SEGMENT, MEDIUM_DIGIT_COLON_DATA } };

const uint8_t g_big_digit_start_addresses[3][2] =
{
    { 19, 20 },  // units digit is controlled by SLCD Data register 19 & 20
    { 21, 29 },  // tens digit is controlled by SLCD Data register 21 & 29
    { 31, 32 }   // hundreds digit is controlled by SLCD Data register 31 & 32
};

const uint8_t g_medium_digit_start_addresses[5][2] =
{
    { 6, 7 },  // units digit is controlled by SLCD Data register 29 & 30
    { 8, 9 },  // tens digit is controlled by SLCD Data register 31 & 32
    { 10, 11 },  // hundreds digit is controlled by SLCD Data register 34 & 35
    { 12, 13 },  // thousands digit is controlled by SLCD Data register 36 & 37
    { 17, 18 }   // ten-thousands digit is controlled by SLCD Data register 38 & 39
};

const uint8_t g_big_digit_data[10][2] =
{
    { 0x05, 0x0f }, // 0 digit is display by writing 0x05 and 0x0f to the appropriate big_digit_start_addresses
    { 0x00, 0x06 }, // 1 digit is display by writing 0x00 and 0x06 to the appropriate big_digit_start_addresses
    { 0x06, 0x0b }, // 2 digit is display by writing 0x06 and 0x0b to the appropriate big_digit_start_addresses
    { 0x02, 0x0f }, // 3 digit is display by writing 0x02 and 0x0f to the appropriate big_digit_start_addresses
    { 0x03, 0x06 }, // 4 digit is display by writing 0x03 and 0x06 to the appropriate big_digit_start_addresses
    { 0x03, 0x0d }, // 5 digit is display by writing 0x03 and 0x0d to the appropriate big_digit_start_addresses
    { 0x07, 0x0d }, // 6 digit is display by writing 0x07 and 0x0d to the appropriate big_digit_start_addresses
    { 0x00, 0x07 }, // 7 digit is display by writing 0x00 and 0x07 to the appropriate big_digit_start_addresses
    { 0x07, 0x0f }, // 8 digit is display by writing 0x07 and 0x0f to the appropriate big_digit_start_addresses
    { 0x03, 0x0f }  // 9 digit is display by writing 0x03 and 0x0f to the appropriate big_digit_start_addresses
};

const uint8_t g_medium_digit_data[10][2] =
{
    { 0x0f, 0x0a }, // 0 digit is display by writing 0x0f and 0x0a to the appropriate medium_digit_start_addresses
    { 0x06, 0x00 }, // 1 digit is display by writing 0x06 and 0x00 to the appropriate medium_digit_start_addresses
    { 0x0d, 0x06 }, // 2 digit is display by writing 0x0d and 0x06 to the appropriate medium_digit_start_addresses
    { 0x0f, 0x04 }, // 3 digit is display by writing 0x0f and 0x04 to the appropriate medium_digit_start_addresses
    { 0x06, 0x0c }, // 4 digit is display by writing 0x06 and 0x0c to the appropriate medium_digit_start_addresses
    { 0x0b, 0x0c }, // 5 digit is display by writing 0x0b and 0x0c to the appropriate medium_digit_start_addresses
    { 0x0b, 0x0e }, // 6 digit is display by writing 0x0b and 0x0e to the appropriate medium_digit_start_addresses
    { 0x0e, 0x00 }, // 7 digit is display by writing 0x0e and 0x00 to the appropriate medium_digit_start_addresses
    { 0x0f, 0x0e }, // 8 digit is display by writing 0x0f and 0x0e to the appropriate medium_digit_start_addresses
    { 0x0f, 0x0c }  // 9 digit is display by writing 0x0f and 0x0c to the appropriate medium_digit_start_addresses
};

const uint8_t g_big_digit_error_data[2][2] =
{
    { 0x07, 0x09 }, // E character is display by writing 0x07 and 0x09 to the appropriate medium_digit_start_addresses
    { 0x06, 0x00 }  // r character is display by writing 0x06 and 0x00 to the appropriate medium_digit_start_addresses
};

const uint8_t g_medium_digit_error_data[3][2] =
{
    { 0x09, 0x0e }, // E character is display by writing 0x09 and 0x0e to the appropriate medium_digit_start_addresses
    { 0x00, 0x06 }, // r character is display by writing 0x00 and 0x06 to the appropriate medium_digit_start_addresses
    { 0x03, 0x06 }  // o character is display by writing 0x03 and 0x06 to the appropriate medium_digit_start_addresses
};

/**********************************************************************************************************************
 * Function Name: slcdc_init
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
bool_t slcdc_init(void)
{
    bool_t    opened = false;

