renesas/ra-fsp-examples/example_projects/ek_ra4l1/_quickstart/quickstart_ek_ra4l1_ep/e2studio/src/slcd.c
    fsp_err_t err    = FSP_SUCCESS;

    err = g_slcdc.p_api->open (g_slcdc.p_ctrl, g_slcdc.p_cfg);

    if (FSP_SUCCESS != err)
    {
        return err;
    }

    err = g_slcdc.p_api->start (g_slcdc.p_ctrl);
    if (FSP_SUCCESS != err)
    {
        return err;
    }

    err = g_slcdc.p_api->setDisplayArea (g_slcdc.p_ctrl, SLCDC_DISP_A);
    if (FSP_SUCCESS != err)
    {
        return err;
    }

    if (FSP_SUCCESS == err)
    {
        opened = true;
    }

    g_slcdc.p_api->write (g_slcdc.p_ctrl, START_SEGMENT, s_slcd_frame_buffer, SEGMENT_COUNT);

    return (opened);
}
/**********************************************************************************************************************
 End of function slcdc_init
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: set_segments_medium_digits
 * Description  : .
 * Arguments    : value
 *              : point_or_colon
 * Return Value : .
 *********************************************************************************************************************/
fsp_err_t set_segments_medium_digits(uint32_t value, e_medium_dp_or_colon_t point_or_colon)
{

    fsp_err_t err = FSP_SUCCESS;

    uint8_t temp_ten_thousands = (uint8_t) ((value / 10000)); /* Cast to uint8_t */
    uint8_t temp_thousands     = (uint8_t) ((value % 10000) / 1000); /* Cast to uint8_t */
    uint8_t temp_hundreds      = (uint8_t) ((value % 1000) / 100); /* Cast to uint8_t */
    uint8_t temp_tens          = (uint8_t) ((value % 100) / 10); /* Cast to uint8_t */
    uint8_t temp_units         = (uint8_t) ((value % 10) / 1); /* Cast to uint8_t */

    /* set / clear the decimal point */
    switch (point_or_colon)
    {
        case SET_DP:
        {
            err = set_segment_icon_named (BIG_DIGIT_DEC_POINT_ICON, ICON_ON);
            break;
        }
        case SET_COLON:
        {
            err = set_segment_icon_named (MEDIUM_DIGIT_COLON_ICON, ICON_ON);
            break;
        }
        case DP_COLON_OFF:
        default:
        {
            err = set_segment_icon_named (MEDIUM_DIGIT_COLON_ICON, ICON_OFF);
            break;
        }
    }

    if (value > 99999)
    {
        /* Write an error message "E r r o r" */
        err = set_segment_icon_named (MEDIUM_DIGIT_DEC_POINT_ICON, ICON_OFF);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][0],
                                    &g_medium_digit_error_data[0][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][1],
                                    &g_medium_digit_error_data[0][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][0],
                                    &g_medium_digit_error_data[1][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][1],
                                    &g_medium_digit_error_data[1][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][0],
                                    &g_medium_digit_error_data[1][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][1],
                                    &g_medium_digit_error_data[1][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][0],
                                    &g_medium_digit_error_data[2][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][1],
                                    &g_medium_digit_error_data[2][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_UNITS][0],
                                    &g_medium_digit_error_data[1][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_UNITS][1],
                                    &g_medium_digit_error_data[1][1], 1);
    }
    else
    {
        if (value > 9999)
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][0],
                                            g_medium_digit_data[temp_ten_thousands][0], MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][1],
                                            g_medium_digit_data[temp_ten_thousands][1], MED_DIGIT_MASK_8_4_2);
        }
        else
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][0],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TEN_THOUSANDS][1],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2);
        }

        if (value > 999)
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][0],
                                            g_medium_digit_data[temp_thousands][0], MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][1],
                                            g_medium_digit_data[temp_thousands][1], MED_DIGIT_MASK_8_4_2);
        }
        else
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][0],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_THOUSANDS][1],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2);
        }

        if (value > 99)
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][0],
                                            g_medium_digit_data[temp_hundreds][0], MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][1],
                                            g_medium_digit_data[temp_hundreds][1], MED_DIGIT_MASK_8_4_2);
        }
        else
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][0],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_HUNDREDS][1],
                                            CLEAR_WRITE_DATA, MED_DIGIT_MASK_8_4_2);
        }

        if (value > 9)
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][0],
                                            g_medium_digit_data[temp_tens][0], MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][1],
                                            g_medium_digit_data[temp_tens][1], MED_DIGIT_MASK_8_4_2);
        }
        else
        {
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][0], CLEAR_WRITE_DATA,
                                            MED_DIGIT_MASK_8_4_2_1);
            err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_TENS][1], CLEAR_WRITE_DATA,
                                            MED_DIGIT_MASK_8_4_2);
        }

        /* Write the Units */
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_UNITS][0],
                                        g_medium_digit_data[temp_units][0], MED_DIGIT_MASK_8_4_2_1);
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, g_medium_digit_start_addresses[MN_UNITS][1],
                                        g_medium_digit_data[temp_units][1], MED_DIGIT_MASK_8_4_2);
    }
    return err;
}
/**********************************************************************************************************************
 End of function set_segments_medium_digits
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: set_segments_big_extras
 * Description  : .
 * Arguments    : use_minus
 *              : dp_setting
 * Return Value : .
 *********************************************************************************************************************/
fsp_err_t set_segments_big_extras(bool use_minus, e_big_digit_dp_t dp_setting)
{
    fsp_err_t err = FSP_SUCCESS;

