renesas/ra-fsp-examples/example_projects/ek_ra4l1/_quickstart/quickstart_ek_ra4l1_ep/e2studio/src/slcd.c
    /* set / clear the minus sign and make the negative number positive for ease of processing */
    if (true == use_minus)
    {
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, BIG_DIGIT_MINUS_SEGMENT, BIG_DIGIT_MINUS_DATA,
                                        (uint8_t) BIG_DIGIT_MINUS_DATA); /* Cast to uint8_t */
    }
    else
    {
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, BIG_DIGIT_MINUS_SEGMENT, CLEAR_WRITE_DATA,
                                        (uint8_t) BIG_DIGIT_MINUS_DATA); /* Cast to uint8_t */
    }

    if (WITH_DP == dp_setting)
    {
        err = R_SLCDC_Modify (&g_slcdc_ctrl, BIG_DIGIT_DEC_POINT_SEGMENT, BIG_DIGIT_DEC_POINT_DATA,
                                (uint8_t) BIG_DIGIT_DEC_POINT_DATA); /* Cast to uint8_t */
    }
    else
    {
        err = R_SLCDC_Modify (&g_slcdc_ctrl, BIG_DIGIT_DEC_POINT_SEGMENT, CLEAR_WRITE_DATA,
                                (uint8_t) BIG_DIGIT_DEC_POINT_DATA); /* Cast to uint8_t */
    }

    return err;
}
/**********************************************************************************************************************
 End of function set_segments_big_extras
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: set_segments_big_digits
 * Description  : .
 * Arguments    : value
 *              : dp_setting
 * Return Value : .
 *********************************************************************************************************************/
fsp_err_t set_segments_big_digits(int16_t value, e_big_digit_dp_t dp_setting)
{
    fsp_err_t err = FSP_SUCCESS;

    int8_t temp_hundreds;
    int8_t temp_tens;
    int8_t temp_units;

    /* set / clear the minus sign and make the negative number positive for ease of processing */
    if (value < 0)
    {
        value = -value;
        err   = g_slcdc.p_api->modify (g_slcdc.p_ctrl, BIG_DIGIT_MINUS_SEGMENT, BIG_DIGIT_MINUS_DATA,
                                        (uint8_t) BIG_DIGIT_MINUS_DATA); /* Cast to uint8_t */
    }
    else
    {
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, BIG_DIGIT_MINUS_SEGMENT, CLEAR_WRITE_DATA,
                                        (uint8_t) BIG_DIGIT_MINUS_DATA); /* Cast to uint8_t */
    }

    temp_hundreds = (int8_t) ((value / 100)); /* Cast int from calculation to int8_t */
    temp_tens     = (int8_t) ((value % 100) / 10); /* Cast int from calculation to int8_t */
    temp_units    = (int8_t) ((value % 10) / 1); /* Cast int from calculation to int8_t */

    if (value > 999)
    {
        /* Write an error message "E r r" */
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][0],
                                    &g_big_digit_error_data[0][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][1],
                                    &g_big_digit_error_data[0][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_TENS][0],
                                    &g_big_digit_error_data[1][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_TENS][1],
                                    &g_big_digit_error_data[1][1], 1);

        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_UNITS][0],
                                    &g_big_digit_error_data[1][0], 1);
        err = g_slcdc.p_api->write (g_slcdc.p_ctrl, g_big_digit_start_addresses[BN_UNITS][1],
                                    &g_big_digit_error_data[1][1], 1);
    }
    else
    {
        /* set / clear the decimal point */
        if (WITH_DP == dp_setting)
        {
            err = R_SLCDC_Modify (&g_slcdc_ctrl, BIG_DIGIT_DEC_POINT_SEGMENT, BIG_DIGIT_DEC_POINT_DATA,
                                    (uint8_t) BIG_DIGIT_DEC_POINT_DATA); /* Cast to uint8_t */
        }
        else
        {
            err = R_SLCDC_Modify (&g_slcdc_ctrl, BIG_DIGIT_DEC_POINT_SEGMENT, CLEAR_WRITE_DATA,
                                    (uint8_t) BIG_DIGIT_DEC_POINT_DATA); /* Cast to uint8_t */
        }

        if (value > 99)
        {
            /* set the HUNDREDS digit */
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][0],
                                    g_big_digit_data[temp_hundreds][0], BIG_DIGIT_MASK_4_2_1);
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][1],
                                    g_big_digit_data[temp_hundreds][1], BIG_DIGIT_MASK_8_4_2_1);
        }
        else
        {
            /* Clear the HUNDREDS digit of any old and redundant segments */
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][0], CLEAR_WRITE_DATA,
                                    BIG_DIGIT_MASK_4_2_1);
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_HUNDREDS][1], CLEAR_WRITE_DATA,
                                    BIG_DIGIT_MASK_8_4_2_1);
        }

        if (value > 9)
        {
            /* set the TENS digit */
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][0],
                                    g_big_digit_data[temp_tens][0], BIG_DIGIT_MASK_4_2_1);
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][1],
                                    g_big_digit_data[temp_tens][1], BIG_DIGIT_MASK_8_4_2_1);
        }
        else
        {
            /* Clear the TENS digit of any old and redundant segments */
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][0], CLEAR_WRITE_DATA,
                                    BIG_DIGIT_MASK_4_2_1);
            err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][1], CLEAR_WRITE_DATA,
                                    BIG_DIGIT_MASK_8_4_2_1);
        }

        /* set the UNITS digit */
        err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_UNITS][0], g_big_digit_data[temp_units][0],
                                BIG_DIGIT_MASK_4_2_1);
        err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_UNITS][1], g_big_digit_data[temp_units][1],
                                BIG_DIGIT_MASK_8_4_2_1);

