renesas/ra-fsp-examples/example_projects/ek_ra4l1/_quickstart/quickstart_ek_ra4l1_ep/e2studio/src/slcd.c
        if (value < 10)
        {
            if (WITH_DP == dp_setting)      // write a 0 so we display 0.X
            {
                err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][0], g_big_digit_data[0][0],
                                        BIG_DIGIT_MASK_4_2_1);
                err = R_SLCDC_Modify (&g_slcdc_ctrl, g_big_digit_start_addresses[BN_TENS][1], g_big_digit_data[0][1],
                                        BIG_DIGIT_MASK_8_4_2_1);
            }
        }
    }
    return err;
}
/**********************************************************************************************************************
 End of function set_segments_big_digits
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: set_segment_icon_named
 * Description  : .
 * Arguments    : segment_name
 *              : setting
 * Return Value : .
 *********************************************************************************************************************/
fsp_err_t set_segment_icon_named(uint16_t segment_name, e_on_or_off_t setting)
{
    fsp_err_t err = FSP_SUCCESS;

    uint16_t segment_address = (segment_name & 0xff00) >> 8;
    uint16_t segment_data    = (segment_name & 0x00ff);

    if (ICON_ON == setting)
    {
        /* Write the specified segment */
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, (uint8_t) segment_address, (uint8_t) segment_data,
                                        (uint8_t) segment_data);
    }
    else
    {
        /* Clear the specified segment */
        err = g_slcdc.p_api->modify (g_slcdc.p_ctrl, (uint8_t) segment_address, (uint8_t) CLEAR_WRITE_DATA,
                                        (uint8_t) segment_data);
    }
    return err;
}
/**********************************************************************************************************************
 End of function set_segment_icon_named
 *********************************************************************************************************************/


#ifdef R_USE_SEGMENT_FUNCTIONS
fsp_err_t set_segments_icon_dow(day_of_week_t day_of_week )
{
    fsp_err_t err = FSP_SUCCESS;

    if(DOW_OFF == day_of_week )
    {
        for(uint8_t loop=0; loop<7; loop++ )
        {
            err = R_SLCDC_Modify(&g_slcdc_ctrl, g_day_of_week_segment[loop].segment,
                                    CLEAR_WRITE_DATA, g_day_of_week_segment[loop].data);
        }
    }
    else
    {
        uint8_t mask = 0x01;
        for(uint8_t count=0; count<7; count++ )
        {
            if((mask & day_of_week) == mask )
            {
                err = R_SLCDC_Modify(&g_slcdc_ctrl, g_day_of_week_segment[count].segment,
                                        (uint8_t) g_day_of_week_segment[count].data, g_day_of_week_segment[count].data);
            }
            else
            {
                err = R_SLCDC_Modify(&g_slcdc_ctrl, g_day_of_week_segment[count].segment,
                                        CLEAR_WRITE_DATA, (uint8_t) g_day_of_week_segment[count].data);
            }
            mask = mask << 1;
        }
    }
    return err;
}


fsp_err_t set_segments_icon_battery(battery_level_t level )
{
    fsp_err_t err = FSP_SUCCESS;

    if(BATTERY_OFF == level )
    {
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_battery_level_segment[0].segment,
                                    CLEAR_WRITE_DATA, (uint8_t) g_battery_level_segment[0].data );
        for(uint8_t loop=0; loop<4; loop++ )
        {
            err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_battery_level_segment[loop+1].segment,
                                        CLEAR_WRITE_DATA, (uint8_t) g_battery_level_segment[loop+1].data );
        }
    }
    else
    {
        // Always draw the outer battery symbol
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_battery_level_segment[0].segment,
                                    g_battery_level_segment[0].data, (uint8_t) g_battery_level_segment[0].data );

        // Clear all the existing level bars
        //err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, battery_level_segment[level].segment,
        //      CLEAR_WRITE_DATA, (uint8_t) battery_level_segment[level].data );
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_battery_level_segment[BATTERY_FULL].segment,
                                    CLEAR_WRITE_DATA, (uint8_t) g_battery_level_segment[BATTERY_FULL].data );

        // Write the new level bars
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_battery_level_segment[level].segment,
                                    g_battery_level_segment[level].data, (uint8_t) g_battery_level_segment[level].data);
    }
    return err;
}


fsp_err_t set_segments_icon_am_pm(am_or_pm_t setting )
{
    fsp_err_t err = FSP_SUCCESS;

    // Clear AM & PM segments
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_am_or_pm[0].segment, CLEAR_WRITE_DATA, (uint8_t) g_am_or_pm[0].data );
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_am_or_pm[1].segment, CLEAR_WRITE_DATA, (uint8_t) g_am_or_pm[1].data );

    if(AM_PM_OFF != setting)
    {
        // Write the specified segment
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_am_or_pm[setting].segment,
                                    g_am_or_pm[setting].data, (uint8_t) g_am_or_pm[setting].data );
    }
    return err;
}


fsp_err_t set_segments_icon_degC_degF(degc_or_degf_t setting )
{
    fsp_err_t err = FSP_SUCCESS;

    // Clear AM & PM segments
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_degc_or_degf[0].segment,
                                CLEAR_WRITE_DATA, (uint8_t) g_degc_or_degf[0].data );
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_degc_or_degf[1].segment,
                                CLEAR_WRITE_DATA, (uint8_t) g_degc_or_degf[1].data );

    if(DEG_C_F_OFF != setting)
    {
        // Write the specified segment
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_degc_or_degf[setting].segment,
                                    g_degc_or_degf[setting].data, (uint8_t) g_degc_or_degf[setting].data );
    }
    return err;
}


fsp_err_t set_segments_icon_medium_dp_colon(e_medium_dp_or_colon_t setting )
{
    fsp_err_t err = FSP_SUCCESS;

    // Clear DECIMAL POINT & COLON
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_medium_digit_dp_or_colon[0].segment,
                                CLEAR_WRITE_DATA, (uint8_t) g_medium_digit_dp_or_colon[0].data );
    err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_medium_digit_dp_or_colon[1].segment,
                                CLEAR_WRITE_DATA, (uint8_t) g_medium_digit_dp_or_colon[1].data );

    if (DP_COLON_OFF != setting)
    {
        // Write the specified segment
        err = g_slcdc.p_api->modify(g_slcdc.p_ctrl, g_medium_digit_dp_or_colon[setting].segment,
                                    g_medium_digit_dp_or_colon[setting].data,
                                    (uint8_t) g_medium_digit_dp_or_colon[setting].data);
    }
    return err;
}

#endif

